; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 408090 2 3 4 7 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	image3 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	Star0 - direction
	Star4 - direction
	Star6 - direction
	GroundStation2 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(calibration_target instrument1 Star0)
	(supports instrument2 image3)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
)
(:goal (and
	(pointing satellite0 Planet7)
	(pointing satellite1 Planet11)
	(have_image Planet7 spectrograph1)
	(have_image Phenomenon8 spectrograph2)
	(have_image Star9 spectrograph2)
	(have_image Star10 spectrograph2)
	(have_image Planet11 spectrograph1)
))

)

; plan
1. (turn_to satellite0 planet7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet7)
   goals met: 2 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 7
3. (turn_to satellite1 star4 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star4)
   goals met: 1 of 7
4. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 1 of 7
5. (turn_to satellite1 star9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star9)
   goals met: 1 of 7
6. (take_image satellite1 star9 instrument2 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 2 of 7
7. (turn_to satellite1 star10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star10)
   goals met: 2 of 7
8. (take_image satellite1 star10 instrument2 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 3 of 7
9. (turn_to satellite1 star0 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star0)
   goals met: 3 of 7
10. (turn_to satellite1 phenomenon8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 7
11. (take_image satellite1 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 4 of 7
12. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 4 of 7
13. (turn_to satellite1 star0 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star0)
   goals met: 4 of 7
14. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 4 of 7
15. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 4 of 7
16. (turn_to satellite1 planet7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet7)
   goals met: 4 of 7
17. (take_image satellite1 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 5 of 7
18. (turn_to satellite1 planet11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet11)
   goals met: 6 of 7
19. (take_image satellite1 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 7 of 7
